      01 CUSTOMER-DATA.
        05 CUSTOMER-INFO. 
          10  LAST-NAME                        PIC X(20). 
          10  FIRST-NAME                       PIC X(20).
          10  FILLER                           PIC X(12).
        05 DEMOGRAPHICS.
          10  DEMO-AGE                         PIC 999.    
          10  DEMO-INCOME                      PIC S9(9)V99 COMP-3.
          10  DEMO-SEX                         PIC X.
          10  DEMO-MSTATUS                     PIC X. 
          10  FILLER                           PIC X(40).
