      01 CUSTOMER-DATA.
         05  CUST-HEADER.
             10  CUSTOMER-NUMBER              PIC 9(9).
             10  LAST-NAME                    PIC X(20).
             10  FIRST-NAME                   PIC X(20).
         05  COMMENTS                         PIC X(4096).
